// Напишите программу, которая на вход принимает число и выдаёт, 
//является ли число чётным (делится оно на два и без остатка).
Console.WriteLine("введите число");
int a = 4;
int b = -3;
int c =7;
if (a == 0)
{
Console.WriteLine("делится на 2");
}
Console.Write(a);
if (b==0)
{
Console.WriteLine();
}
if (c==0)
{
Console.WriteLine();
}
else 
{
    Console.WriteLine("делится на 2");
}
Console.WriteLine();


