//напишите программу которая на вход принимает число N,
// а на выходе показывает все четные числа от 1 до N. 
Console.WriteLine("введите число");
int i =1;
int n  = Convert.ToInt32(Console.ReadLine());
if ( i % 2 ==0)
for ( i =2; i<=n ; i+=2);

Console.WriteLine( "чётное");
